{
    "Projects": [
        {
            "id": 1,
            "internal": "/projects/epdata",
            "name": "EPData.",
            "thumbnail": "proimg2",
            "link": "https://www.epdata-tracker.com/",
            "github": "https://github.com/JoT8ng/Archi-EPD-Tracker-Web-App",
            "description": "EPData. is a work in progress free web tool that allows architects and other construction professionals to track and visualize embodied carbon emissions of various construction material options. There is increasing demand in the construction industry to source sustainable materials, calculate embodied carbon emissions, and conduct whole life cycle analysis of buildings. EPDs have emerged as one of the most popular ways to measure the carbon footprint and global warming potential of building materials. EPD stands for Environmental Product Declaration. An EPD is a formal document that contains information about the environmental impact and performance of a product. Product manufacturers have increasingly used and produced EPDs because they conform to international standards and are used to demonstrate compliance."
        },
        {
            "id": 2,
            "internal": "/projects/hydrodams",
            "name": "International Rivers - Hydropower Dams in Sub-Saharan Africa",
            "thumbnail": "proimg1",
            "link": "https://www.hydropowerdamsmap.org/",
            "github": "https://github.com/IntlRivers/hydropowerdams-map",
            "description": "The Sub-saharan African Hydropower Dams Map is a collaborative ongoing project, mapping prospective and existing dams across the region. It details financial, environmental and social consequences of the projects."
        },
        {
            "id": 3,
            "internal": "/projects/movies-wrapped",
            "name": "Movies-Wrapped (ongoing)",
            "thumbnail": "proimg3",
            "link": "https://github.com/JoT8ng/movies-wrapped",
            "github": "https://github.com/JoT8ng/movies-wrapped",
            "description": "Work in progress non-commercial app that allows users to keep track of movies and shows they watched. Users can generate yearly and monthly summaries. This product uses the TMDB API but is not endorsed or certified by TMDB."
        },
        {
            "id": 4,
            "internal": "https://snake-game-ten-black.vercel.app",
            "name": "JavaScript Snake Game!",
            "thumbnail": "proimg4",
            "link": "https://snake-game-ten-black.vercel.app",
            "github": "https://github.com/JoT8ng/snake-game",
            "description": "A simple JavaScript snake game. Created while attending MLH Global Hack Week Games 2024. In singleplayer mode use the 'W' 'A' 'S' 'D' keys on the keyboard to control the player/blue snake to eat food (orange square). The more food you eat without dying the higher your score. You will die if you hit the enemy snake or you hit yourself. In multiplayer mode another player can use the arrow keys on the keyboard to control the enemy snake to attack the blue snake."
        },
        {
            "id": 5,
            "internal": "https://vimeo.com/manage/videos/922357455",
            "name": "Pygame Feed Mushy the Whale",
            "thumbnail": "proimg5",
            "link": "https://jot8ng.itch.io/feed-mushy-the-whale",
            "github": "https://github.com/JoT8ng/feed-mushy-the-whale-game",
            "description": "A simple Python game made using Pygame! Created while attending MLH Global Hack Week Games 2024."
        },
        {
            "id": 6,
            "internal": "https://github.com/JoT8ng/fullstackopen",
            "name": "Full Stack Open Course - Projects",
            "thumbnail": "proimg6",
            "link": "https://github.com/JoT8ng/fullstackopen",
            "github": "https://github.com/JoT8ng/fullstackopen",
            "description": "Full stack project highlights from the course by the University of Helsinki. Direct link to Github repository."
        }
    ],
    "GISProjects": [
        {
            "id": 1,
            "internal": "nile-dams",
            "name": "Dams on the Nile- A Narrative of Ecocide",
            "thumbnail": "gisimg1",
            "description": "Control of the Nile river is highly strategic where dam building is fraught with geo-political tensions as water is an extremely precious commodity. The project advocates for the rights of the Nile by claiming that current planning and construction of the Grand Ethiopian Renaissance dam (GERD), which is the next mega infrastructure to be built, is an act of Ecocide."
        },
        {
            "id": 2,
            "internal": "inga",
            "name": "Inga River Mapping Project",
            "thumbnail": "gisimg2",
            "description": "International Rivers Africa approached me to help advocate against the Inga 3 Dam in the Democratic Republic of Congo (DRC). Research, spatial analysis, and visualization work into the negative environmental and socio-economic impacts the dam will have in the region are conducted alongside a women’s rights NGO, FESO. This work is done in tandem with on site fieldwork with communities affected by the dam."
        },
        {
            "id": 3,
            "internal": "steppe",
            "name": "Grain by Grain - Steppe Intensification",
            "thumbnail": "gisimg3",
            "description": "A research project that investigates the spaces of the Russian steppe. The agricultural industry in Russia aims to sustain a large population as Putin seeks to make the country one of the largest agricultural producers in the world with ideas of geopolitical expansion. This results in intensive chemical fertilizer and irrigation use, exhausting the soil and increasing fossil fuel consumption. Vast monocultures of crops contribute to biodiversity loss and lack of resilience to climate change."
        },
        {
            "id": 4,
            "internal": "van-deforest",
            "name": "Old-Growth Deforestation - Vancouver Island",
            "thumbnail": "gisimg4",
            "description": "GIS remote sensing supervised and unsupervised classification analysis, tracking deforestation on Vancouver Island's old-growth forests."
        }
    ]
}